candy-store/app/controllers/candies_controller.rb

SELECT "candies".* FROM "candies"
---
    def index
        @candies = Candy.all

SELECT "candies".* FROM "candies" WHERE "candies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @candy = Candy.find(params[:id])